docs/munkres-index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-23 Fri 16:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Munkres, Topology</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/latex.css/dist/latex.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Munkres, Topology</h1>
<p>
For any math major, perhaps Munkres&rsquo; <i>Topology</i> is one of quintessential &ldquo;math&rdquo; books; since it is often that courses prior (Linear Algebra, say) are often attended by Physics or CS majors. It is also at this instant that Mathematics takes a more abstract, inward-focusing turn.
</p>

<p>
But the subject is so central in Mathematics and the author&rsquo;s treatment of it so complete at a basic level, I frequently find a need to consult it when my faculties fail me. Hence I thought of creating a digital version of notes, not only for better memorization but also for references from &ldquo;higher&rdquo; courses.
</p>

<p>
<b>Note.</b> I wouldn&rsquo;t cover the set theory chapter, since the material is common in textbooks. I would use my own notation throughout. See my set theory notes for details.
</p>

<ul class="org-ul">
<li><a href="munkres-topology-ch1.html">Chapter 2</a></li>
</ul>
</div>
</body>
</html>
